In [35]:
import numpy as np
import pandas as pd
from dateutil.parser import parse
import ssl
ssl._create_default_https_context = ssl._create_unverified_context

In [23]:
import random

# 1

In [8]:
def create_nympy(start: int,lenght: int,step: int) ->np.array:
    stop
    arr1 = np.arange(start,lenght,step)
    return arr1

In [9]:
result = create_nympy(6,100,4)

In [10]:
result

array([ 6, 10, 14, 18, 22, 26, 30, 34, 38, 42, 46, 50, 54, 58, 62, 66, 70,
       74, 78, 82, 86, 90, 94, 98])

# 2

In [11]:
a = np.array([1,2,3,np.nan,5,6,7,np.nan])

In [21]:
x=np.delete(a,3)

In [22]:
np.delete(x,-1)

array([1., 2., 3., 5., 6., 7.])

# 3

In [25]:
x = np.random.randint(100,size=(5,6))
x.max(axis=1)

array([97, 99, 63, 72, 97])

## 4

In [30]:
series = pd.Series(np.take(list('abcdefghijklmnop'), np.random.randint(16, size=500)))
series.value_counts()

d    37
j    36
c    36
g    35
f    34
p    34
a    33
e    32
i    31
h    30
k    30
n    29
l    29
b    28
m    24
o    22
dtype: int64

5

In [34]:
series = pd.Series(['01 Jan 2020', '10-19-2020', '20150303', '2013/04/04', '2012-05-05', '2013-06-06T12:20'])
print(series)
series = series.map(lambda x: parse(x))
print(series.dt.day.tolist())
print(series.dt.dayofyear.tolist())
print(series.dt.weekofyear.tolist())
print(series.dt.weekday.tolist())

0         01 Jan 2020
1          10-19-2020
2            20150303
3          2013/04/04
4          2012-05-05
5    2013-06-06T12:20
dtype: object
[1, 19, 3, 4, 5, 6]
[1, 293, 62, 94, 126, 157]
[1, 43, 10, 14, 18, 23]
[2, 0, 1, 3, 5, 3]

/var/folders/g8/jbmgpm3s3px94c2_6lwk_xfw0000gn/T/ipykernel_3614/215348795.py:6: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  print(series.dt.weekofyear.tolist())

6

In [36]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.dtypes.value_counts()

float64    18
object      9
dtype: int64

In [37]:
df.rename(columns={'Type' : 'TypeOfCar'},inplace=True)
df.isna().sum()

Manufacturer           4
Model                  1
TypeOfCar              3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

In [38]:
df.isna().sum().idxmax()

'Luggage.room'

7

In [40]:
df1 = df.copy()
df2 = df.copy()

In [41]:
columns_to_remove=['EngineSize','Length']

In [48]:
# df1.drop(columns = columns_to_remove)

In [49]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

9

In [64]:
df = pd.DataFrame(["STD,City\tState",
"33,Kolkata\tWest Bengal",
"44,Chennai\tTamil Nadu",
"40,Hyderabad\tTelengana",
"80,Bangalore\tKarnataka"], columns=['row'])
df

                       row
0          STD,City\tState
1  33,Kolkata\tWest Bengal
2   44,Chennai\tTamil Nadu
3  40,Hyderabad\tTelengana
4  80,Bangalore\tKarnataka

In [65]:
df[['STD','City']]=df.row.str.split(',', expand=True)

In [66]:
df

                       row  STD                  City
0          STD,City\tState  STD           City\tState
1  33,Kolkata\tWest Bengal   33  Kolkata\tWest Bengal
2   44,Chennai\tTamil Nadu   44   Chennai\tTamil Nadu
3  40,Hyderabad\tTelengana   40  Hyderabad\tTelengana
4  80,Bangalore\tKarnataka   80  Bangalore\tKarnataka

In [67]:
del df['row']

In [68]:
df

   STD                  City
0  STD           City\tState
1   33  Kolkata\tWest Bengal
2   44   Chennai\tTamil Nadu
3   40  Hyderabad\tTelengana
4   80  Bangalore\tKarnataka

In [69]:
df[['City','State']]=df.City.str.split('\t', expand=True)

In [70]:
df

   STD       City        State
0  STD       City        State
1   33    Kolkata  West Bengal
2   44    Chennai   Tamil Nadu
3   40  Hyderabad    Telengana
4   80  Bangalore    Karnataka

In [71]:
df=df.iloc[1:].reset_index()

In [72]:
df

   index STD       City        State
0      1  33    Kolkata  West Bengal
1      2  44    Chennai   Tamil Nadu
2      3  40  Hyderabad    Telengana
3      4  80  Bangalore    Karnataka

In [73]:
del df['index']

In [74]:
df

  STD       City        State
0  33    Kolkata  West Bengal
1  44    Chennai   Tamil Nadu
2  40  Hyderabad    Telengana
3  80  Bangalore    Karnataka